benchmarks/ringo-node/no-alloc/node.out
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 0.0.0.0 (be patient)


Server Software:        
Server Hostname:        0.0.0.0
Server Port:            8001

Document Path:          //
Document Length:        1024 bytes

Concurrency Level:      50
Time taken for tests:   6.817 seconds
Complete requests:      50000
Failed requests:        0
Write errors:           0
Total transferred:      54400000 bytes
HTML transferred:       51200000 bytes
Requests per second:    7335.13 [#/sec] (mean)
Time per request:       6.817 [ms] (mean)
Time per request:       0.136 [ms] (mean, across all concurrent requests)
Transfer rate:          7793.57 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.3      0      10
Processing:     0    7   3.1      7      24
Waiting:        0    7   3.1      7      24
Total:          0    7   3.1      7      24

Percentage of the requests served within a certain time (ms)
  50%      7
  66%      8
  75%      9
  80%     10
  90%     11
  95%     11
  98%     12
  99%     14
 100%     24 (longest request)