benchmarks/ringo-node/no-alloc/ringo.out
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 0.0.0.0 (be patient)


Server Software:        Jetty(7.1.6.v20100715)
Server Hostname:        0.0.0.0
Server Port:            8001

Document Path:          //
Document Length:        1024 bytes

Concurrency Level:      50
Time taken for tests:   11.705 seconds
Complete requests:      50000
Failed requests:        0
Write errors:           0
Total transferred:      58040600 bytes
HTML transferred:       51235840 bytes
Requests per second:    4271.59 [#/sec] (mean)
Time per request:       11.705 [ms] (mean)
Time per request:       0.234 [ms] (mean, across all concurrent requests)
Transfer rate:          4842.30 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    6   0.9      6      13
Processing:     2    6   1.3      6      24
Waiting:        0    5   1.5      5      20
Total:          5   12   1.2     11      29

Percentage of the requests served within a certain time (ms)
  50%     11
  66%     11
  75%     12
  80%     12
  90%     12
  95%     14
  98%     16
  99%     17
 100%     29 (longest request)